import { Injectable } from '@angular/core';
import { ServicesContent } from '../interfaces/services-content';

@Injectable({
  providedIn: 'root',
})
export class ServicesDataService {
  constructor() {}

  data: ServicesContent[] = [
    {
      image: '/assets/images/الكرايوثيرابى.jpg',
      title: 'جهاز الكرايوثيرابى',
      less: [
        ' من أفضل تقنيات التخسيس الموضعى اللى تقدر تنزل من البطن 18سم فى شهرين فقط.😉',
      ],
      all: `لأنه بيقوم بتجميد الخلايا الدهنية وبطريقة آمنة من غير أي تدخل جراحي ولا تخدير.
          وبيستخدم لمناطق كتيرة فى الجسم زى👇:
          - الأرداف.
          - البطن.
          - الفخذين.
          -الذراعين.
          - الساقين.
          وللجهاز مميزات كتيرة زى:
          -لا يسبب الألم.
          -يناسب جميع أنواع البشرة.
          -مش بيأثر على الأنسجة الخارجية.
          -العودة للحياة الطبيعية فورًا.
          -مش بيحتاج تخدير أو مسكنات لأنه إجراء غير جراحى.
          وطبعًا نتيجيته فعالة بنسبة كبيرة.`,
      isshow: false,
    },
    {
      image: '/assets/images/ماهو-الانزلاق-الغضروفي.jpg',
      title: 'ماهو هو الانزلاق الغضروفي؟',
      less: [
        ` يوجد ديسكات مرنة بين فقرات الظهر والتي تعمل على امتصاص الصدمات المختلفة التي يتعرض لها الجسم، ولكنها وفي بعض
          الأحيان قد تنزلق خارجة من مكانها أو قد تتمزق`,
      ],
      all: `أعراض الانزلاق الغضروفي👌
          هناك أعراض شائعة وهناك أعراض أخرى غير شائعة أو قد لا يتم ربطها عادة بالانزلاق الغضروفي، وهذه أهم الأعراض:
          1- الألم
          2- وخز وتنميل
          3- ضعف عام في العضلات
          4- صعوبات عند محاولة الوقوف أو الجلوس
          5- ألم حاد ومفاجئ عند القيام بحركات معينة
          6- برودة جانب واحد من الجسم!
          7- ألم في الظهر عند العطس أو السعال
          العلاج 🤔
          للعلاج الطبيعى الدور الأكبر في علاج الانزلاق الغضروفي بجانب المسكنات و مضادات الالتهاب 👌
          بنوفرلك أفضل آليات العلاج اليدوي واحدث الاجهزة الفعالة في إحداث تحسن من الجلسات الأولي ❤️
          .`,
      isshow: false,
    },
    {
      image: '/assets/images/اصابات الملاعب.jpg',
      title: 'تعتبر إصابات الملاعب من أكبر مخاوف أى رياضى 😥',
      less: [
        ' و كمان بالنسبة للأشخاص العاديين اللى بيمارسوا رياضة معينة لأنها ممكن تسبب أضرار كبيرة تستمر لفترات',
      ],
      all: `عشان كده العلاج الطبيعي لإصابات الملاعب من أهم طرق العلاج اللى بيخضع لها المصاب عشان يرجع قوته وقدرته على الحركة من تانى 💪
فى مركز الدكتوره أميره للعلاج الطبيعي والتغذية العلاجية بنوفرلك أفضل خدمة التأهيل بعد الإصابات و ده عن طريق: 👇
✅ تقسيم الحالة والإصابة ومعرفة أسباب الإصابة
✅ علاج وتخفيف الألم وضعف العضلات الناتج عن الإصابة
✅ إعادة الرياضى للقدرة اللى كان بيلعب بيها سابقًا
✅ تقييم الحالة الصحية للرياضى و أى مخاطر ممكن تواجهه أثناء ممارسته الرياضة لمنع حدوث أى إصابة جديدة أو تكرار الإصابة نفسها
معانا هنساعدك ترجع تقف على رجلك من تانى و تمارس رياضتك بشكل طبيعى 👌`,
      isshow: false,
    },
    {
      image: '/assets/images/العلاج الطبيعي اليدوي.jpg',
      title: 'عندنا هترتاح من اول جلسه ❤',
      less: [
        ` جربت علاجات ومسكنات ولفيت عند دكاتره كتير ومفيش نتيجه 😓
          العلاج الطبيعي اليدوي هو الحل الامثل و الأكثر فاعليه
          لآلام وتقلصات الرقبه وخلف لوح الكتف ومنتصف واسفل الظهر`,
      ],
      all: `جربت علاجات ومسكنات ولفيت عند دكاتره كتير ومفيش نتيجه 😓
عندنا هترتاح من اول جلسه ❤
العلاج الطبيعي اليدوي هو الحل الامثل و الأكثر فاعليه 
لآلام وتقلصات الرقبه وخلف لوح الكتف ومنتصف واسفل الظهر 
اللي بتكون مزعجه جدا وبتكون نتيجه لتراكمات أوضاع خاطئه 
او نتيجه لاصابه زي الانزلاقات الغضروفيه 
العلاج الطبيعي ف الجلسه بيكون للعضلات المصابه بهذه التقلصات لاعاده النسيج العضلي لطبيعته واللي بعده بتشعر براحه كبيره جدا 
وايضا للمفصل المتاثر او الفقرات المتاثره بالشد او التقلصات ف العضلات القريبه منها`,
      isshow: false,
    },
    {
      image: '/assets/images/كوع التنس.jpg',
      title: 'تعرف ايه عن كوع التنس',
      less: [
        ` كوع التنس هو حالة شائعة بسبب الإستخدام المفرط لعضلات الذراع، واليد واللي بينتج عنها آلام الكوع.`,
      ],
      all: ` بيحدث كوع التنس بسبب إجهاد الذراع ومفصل الكوع وما حوله، وممكن أن ينتشر الألم إلى الساعد والرسغ.
• مرفق لاعب التنس يؤثر في الناس اللي بتمارس مجهود أو عمل يدوي و يؤثر على ذراعهم التي يكون الجهد عليها اكثر من الاخرى.
- بتظهر أعراض كوع التنس في صورة 👇
🔹️ ألم يزداد تدريجياً حول الكوع و قد يزداد بشدة مع الوقت و المجهود .
🔹️ الألم عند المصافحة أو عصر الاشياء .
🔹️ يزداد الالم عن الاجهاد المتكرر للعضلات مثل استخدام الكومبيوتر، واستخدام الموبايل
بيتم تشخيص هذا المرض أساسا تشخيص الإكلينيكي بالفحص الطبي ولكن بعض الحالات القليلة تحتاج بعض الاشعات.`,
      isshow: false,
    },
    {
      image: '/assets/images/الحركه بعد الكسر.jpg',
      title: 'العلاج الطبيعى بعد الكسور 👌',
      less: [
        `في الغالب بيحصل ضعف في العضلات المحيطة بمكان الكسر، ويساعد العلاج الطبيعي على إعادة تقويتها والحفاظ على
          كفاءتها`,
      ],
      all: `في الغالب بيحصل ضعف في العضلات المحيطة بمكان الكسر، ويساعد العلاج الطبيعي على إعادة تقويتها والحفاظ على كفاءتها، بالإضافة إلى أن الكسر يمكن أن يكون قريب من المفصل، زي الكسور حول الركبة أو الكوع أو الكتف، والعلاج الطبيعي يكون ضروريا في هذه الحالة ، لإعادة حركة المفصل بشكل كامل، وإعادة تقويته.
كمان يساعد العلاج الطبيعي بعد كسور العظام في تقليل التورم.
✔✔ كلمنا علي أرقامنا واحجز جلستك ❤️`,
      isshow: false,
    },
    {
      image: '/assets/images/العصب السابع.jpg',
      title: 'ما هو العصب السابع ؟',
      less: [
        'هو العصب الوجهى رقم سبعة فى الأعصاب المخية لذلك يُسمى بالعصب السابع أو (بيلز بالسى)',
      ],
      all: `هو العصب الوجهى رقم سبعة فى الأعصاب المخية لذلك يُسمى بالعصب السابع أو (بيلز بالسى) و هو الذي يتحكم في العضلات على جانبي الوجه التى تمكننا من التعبير الإبتسام، الضحك، البكاء وغيرها من تعبيرات الوجه لذلك أي إصابة به تؤثر على تعبيرات الوجه الحركية ورغم أن الإصابة في معظم الحالات تتحسن تلقائياً، ولكن تحتاج الحالة أحياناً إلى الاهتمام بالعلاج الطبيعى والعلاج الدوائى السريع.
🧑‍⚕️ الأعراض التي تحدث عند إصابة العصب السابع 👇👇
✔️ شلل فى عضلات الوجه أو حدوث ضعف بها أو رجفة وعدم القدرة على التحكم بها.
✔️ قد يحدث جفاف في الفم.
✔️ اضطراب فى حاسه التذوق.
✔️ تغير في نبرة الصوت.
✔️ عدم القدرة على الكلام.
✔️ الشعور بالصداع.
✔️ قد يحدث جفاف في العين عدم القدرة على غلقها وذلك بسبب ضعف عضلات الوجه.
✔️ ألم عند الأذن في الجزء المصاب.
قد يحدث زيادة إفراز اللعاب و الدموع.
🧑‍⚕️ أسباب حدوث خلل في العصب السابع 👇👇
✔️ إصابات الوجه أو الحوادث أو إصابات نتيجة الجراحة أو الإصابة عند الولادة للأطفال حديثي الولادة .
✔️ عدوى فيروسية فى الوجه أو الأذن مثل فيرس الهيربس الـذى يُصيب العصب الوجهي.
✔️ إصابات الجهاز العصبي مثل حدوث جلطة فى المخ . التعرض للسموم مثل الكحول أو أول اكسيد الكربون . كما يمكن أن يحدث نتيجة التعرض للضغوط أو التوتر و القلق أو نتيجة تقلبات الجو.
✔️ التعرض لهواء بارد.
✔️ يمكن أن يحدث بعد إجراء العمليات الجراحية لبعض الأمراض كالسرطان.
شلل بيل وهى حالة شلل الوجه الشائعة والغير معروف سببها ولكنها فى الغالب تكون مرتبطة بمرض السكر أو الحمل .
✔️ و قد يحدث المرض نتيجة إصابة أو التهاب العصب الدماغي السابع الذي يتحكم في عضلات الوجه، وبالتالي يؤدي إلى شلل أو ضعف هذه العضلات التي تتحكم في تعبيرات الوجه،و يحدث في الجزء الأيمن أو الأيسر من الوجه ولكن نادراً ما تحدث الإصابة في الجزئين .`,
      isshow: false,
    },
    {
      image: '/assets/images/آلآم الركبه.jpg',
      title: 'حاسس بحاجة من دول في الركبة؟ 🤔',
      less: [
        `⚠️ تورم و تيبس`,
        `⚠️ احمرار و شعور بحرارة عند اللمس`,
        ` ⚠️ الضعف وعدم الاستقرار`,
        ` ⚠️ عدم القدرة على عدل الركبة بالكامل`,
      ],
      all: `ده ممكن يكون سببه حاجة من الحاجات دي:
1/ نتيجة إصابة زى تمزق أحد الاربطة
2/ نتيجة إصابة الغضروف
3/ حالات المرضية زى التهاب المفاصل والنقرس 😣
`,
      isshow: false,
    },
  ];
}
