import { Component } from '@angular/core';
import { OwlOptions } from 'ngx-owl-carousel-o';

@Component({
  selector: 'app-testimonials',
  templateUrl: './testimonials.component.html',
  styleUrls: ['./testimonials.component.css'],
})
export class TestimonialsComponent {
  customOptions: OwlOptions = {
    loop: true,
    rtl: true, // Enable RTL

    mouseDrag: true,
    touchDrag: true,
    pullDrag: true,
    dots: true,
    autoplay: true,
    // items: 2,
    center: true,
    autoplayHoverPause: true,
    autoplaySpeed: 1000,

    responsive: {
      0: {
        items: 1,
      },
      600: {
        items: 1,
      },
      800: {
        items: 2,
      },
      1000: {
        items: 3,
      },
      1200: {
        items: 3,
      },
      1400: {
        items: 3,
      },
      1600: {
        items: 4,
      },
    },
    nav: false,
  };

  alldata = [
    {
      data: `دكتوره محترمه جدا كفايه بس اخلاقها شرحتلي بالتفصيل حالتي بطريقه فوق الممتازه والعياده كمان نضيفه جدا
            واستقبال
            محترم .`,
      name: `Ibrahim Hosny`,
    },
    {
      data: `من امهر الدكاترة بجد وصبوره جداا ودكتوره عندها ضمير بجد بعد معاناه ارتحت جدااا`,
      name: `عبد الله الكاشف`,
    },
    {
      data: `دكتورممتاز جداا والعيادة نضيفة جداا ودكتورمحترم في مواعيده وصبور جداا`,
      name: `Azza Mahmoud`,
    },
    {
      data: `السلام عليكم
            ازي حضرتك يادكتور كنت حابه اشكر حضرتك جدا ع التحسن دا اووي بجد ظهري ارتاح من اول الجلسه التالته مبقتش احس
            بوجع
            زي الاول و بقيت اقدر اصلي و اوطي من غير ما احس ب اي وجع ولسا مكمل مع حضرتك بإذن الل`,
      name: `أم لينا`,
    },
    {
      data: `اذيك يا دكتور يارب تكوني بخير يارب
            حضرتك بعد ربنا طبعا غيرتيلي مجري حياتي كله انا بقيت اعرف امشي كويس واصلي وانا واقفه وبجري واعمل كل الانشطه
            اليوميه عادي زي الاول بعد ما كنت شبه عاجزه
            بعد ما جيت لحضرتك وشخصتيني وبدأتي تشتغلي معايا في الجلسات علي الفقرات بدأت احس بالتحسن بسرعه جدا بعد
            جلستين
            بجد بعد ما خلصنا الكورس كله بقيت كويسه اوي وشكرا ليكي بجد😘`,
      name: `ميرا محمد`,
    },
    {
      data: `انا تسنيم كنت عند حضرتك في العياده انا عندي ٢٠ سنه وكان عندي غضروفين في الفقرات القطنية عانيت من ألم مزمن
            لمده سنه وبعد عناء كشفت مع حضرتك و عملت أشعة و حضرتك شرحتيلي حالتي و عملتيلي جدول للعلاج نمشي عليه و بدأ
            بالجلسات وجلسات شد الفقرات ومع التمارين طبعا بقيت احسن جدا و طبعا التزمت بالتمارين في البيت و التزمت بكل
            التعليمات ولسا مكملتش شهر مع حضرتك وحاسه ب فرق كبير اووي
            فا حضرتك ليكي الفضل بعد ربنا بجد 🥺♥`,
      name: `تسنيم أحمد`,
    },
    {
      data: `اذيك يا دكتوره اميره عامله اي يا حبيبتي
            انا ماشيه علي التمارين اللي قولتيلي اعملها في البيت اهو جنب التمارين اللي بنعملها ف العياده وبجد والله
            التعامل
            عندك في العياده حلو اوي والاستاف كويس جدا في التعامل وحسيت بتحسن اوي في رقيتي وبقيت اعرف احرك رقبتي وانام
            كويس
            ومرتاحه شكرا ليكي قمررر♥`,
      name: `منه علاء`,
    },
  ];
}
